app/controllers/sessions_controller.rb

SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."rest_name" IS NULL LIMIT ?  [["LIMIT", 1]]
---
  def restaurant_create
    @restaurant = Restaurant.find_by(rest_name: params[:rest_name])